app/views/comments/_comment.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
    <strong>
      <%= User.find(comment.user_id).first_name %>