app/views/users/show.html.erb

 <% @user_tags_list.each do |user_selection| %>
 <li><%= topic_name = Topic.find(user_selection.topic_id).topic %></li>
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

        <% @user_tags_list.each do |user_selection| %>
        <li class="topicname", style="list-style-type: none; font-weight: bold;"><%= topic_name = Topic.find(user_selection.topic_id).topic %></li>
---
SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]