app/views/posts/index.html.erb

                            <h3 id='post_subject'><%= link_to post.subject, post_path(post.id) %></h3>
                            <% author_first_name = User.find(post.user_id).first_name%>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

                                <h6 id='comment_header'><strong><em>Comments:</em></strong></h6>
                                <% post_comments = post.comments.map {|comment| comment.to_json(:include => :user)} %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 18]]

            <div id='conversation_mentors'>
                <% @user.mentee_pairings_with_post.each do |pairing| %>
                    <h6><%= User.find(pairing.mentor_id).first_name %></h6>
---
SELECT "pairings".* FROM "pairings" WHERE "pairings"."mentee_id" = $1  [["mentee_id", 16]]
SELECT "posts".* FROM "posts" WHERE "posts"."pairing_id" = $1  [["pairing_id", 6]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

            <div id='conversation_mentees'>
                <% @user.mentor_pairings_with_post.each do |pairing| %>
                    <h6><%= User.find(pairing.mentee_id).first_name %></h6>
---
SELECT "pairings".* FROM "pairings" WHERE "pairings"."mentor_id" = $1  [["mentor_id", 16]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]