app/controllers/comments_controller.rb

    def create
        @comment = Comment.new(comment_params)
        @comment.user_id = @user.id
        @comment.post_id = params[:post_id]
        if @comment.save
---
INSERT INTO "comments" ("comment", "post_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["comment", "test comment"], ["post_id", 18], ["user_id", 16], ["created_at", "2019-01-02 22:24:03.446226"], ["updated_at", "2019-01-02 22:24:03.446226"]]

    def user
        @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]