app/controllers/posts_controller.rb

    def index
      pairings = @user.all_pairings
      @post = []
      pairings.each do |pairing|
        pairing.posts.each do |post|
---
SELECT "posts".* FROM "posts" WHERE "posts"."pairing_id" = $1  [["pairing_id", 6]]

    def create
      @post = Post.new(post_params)
      @post.user_id = @user.id
      @post.pairing_id = @pairing.id
      if @post.save
---
INSERT INTO "posts" ("subject", "body", "created_at", "updated_at", "pairing_id", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

    def edit
      @post = Post.find(params[:id])
      @pairing = Pairing.find(@post.pairing_id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
SELECT  "pairings".* FROM "pairings" WHERE "pairings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

      def user
        @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

      def pairing
        @pairing = Pairing.find(params[:pairing_id])
---
SELECT  "pairings".* FROM "pairings" WHERE "pairings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]