app/controllers/topics_controller.rb

SELECT "topics".* FROM "topics" WHERE (topic LIKE '%ruby%') ORDER BY id DESC
---
  def index
    @topics = Topic.search(params[:term])

SELECT  "topics".* FROM "topics" WHERE "topics"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "user_tags"."user_id" FROM "user_tags" WHERE "user_tags"."topic_id" = $1  [["topic_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def show
    @topic = Topic.find(params[:id])
    @pairing = Pairing.new
    @user_tags = UserTag.where(topic_id: @topic.id).pluck(:user_id)
    @mentors = []
    @user_tags.each { |id|
      if id != session[:user_id]
        @mentors << User.find(id)