app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    # respond_to do |format|
    if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "position", "bio", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def show
    @user_tags = UserTag.new
    @user_tags_list = UserTag.where(user_id: User.find(session[:user_id]))
    @user = User.find(session[:user_id])

    redirect_to @user if session[:user_id] != params[:id].to_i

    @pending_mentor_request = []
    @user.mentor_pairings.each do |pairing|
      if pairing.status == 'pending'
        @pending_mentor_request << User.find(pairing.mentee_id)
      end
    end
    @pending_mentor_request

    params[:topic] ? @users = User.tagged_with(params[:topic]) : @users = User.all
---
SELECT "user_tags".* FROM "user_tags" WHERE "user_tags"."user_id" = $1  [["user_id", 15]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
SELECT "pairings".* FROM "pairings" WHERE "pairings"."mentor_id" = $1  [["mentor_id", 15]]
SELECT "topics".* FROM "topics"