app/controllers/user_tags_controller.rb

INSERT INTO "user_tags" ("created_at", "updated_at", "user_id", "topic_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-01-02 19:00:37.278269"], ["updated_at", "2019-01-02 19:00:37.278269"], ["user_id", 16], ["topic_id", 1]]
---
  def create
    # @user_tags = UserTag.create(params[@user.id, :topic_id])
    @user_tags  = UserTag.new
    @user_tags.topic_id = params[:user_tag][:topic_id]
    @user_tags.user_id = @user.id
    @user_tags.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def user
    @user = User.find(session[:user_id])