app/models/post.rb

SELECT  "pairings".* FROM "pairings" WHERE "pairings"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
    def receiving_user
        pairing = Pairing.find(pairing_id)
        receiving_user = user_id == pairing.mentor_id ? User.find(pairing.mentee_id) : User.find(pairing.mentor_id)