app/views/pairings/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  <% @list_of_mentor_pairings.each do |pairing| %>
    <% user_mentor = User.find(pairing.mentor_id) %>