app/views/pairings/show.html.erb

  <% @pending_mentor_request.each do |pairing| %>
    <% mentee = User.find(pairing.mentee_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]