app/views/user_tags/_form.html.erb

SELECT "topics".* FROM "topics"
---
<div class="field">
  <%= f.input :topic_id, as: :select, collection: Topic.all, label_method: :topic, input_html: {multiple: true} %>