app/views/layouts/_navigation.html.erb

      <% if logged_in? %>
        <% user = User.find(session[:user_id]) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]